app/controllers/notices_controller.rb

SELECT "notices".* FROM "notices"
---
  def index
    @notices = Notice.all

SELECT "notices".* FROM "notices" WHERE "notices"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @notice = Notice.find(params[:id])

SELECT "notices".* FROM "notices" WHERE "notices"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @notice = Notice.find(params[:id])

INSERT INTO "notices" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", ""], ["created_at", Wed, 28 Oct 2015 03:24:04 UTC +00:00], ["title", ""], ["updated_at", Wed, 28 Oct 2015 03:24:04 UTC +00:00], ["user_id", nil]]
---
  def create
    @notice = Notice.new(params[:notice])

    respond_to do |format|
      if @notice.save

SELECT "notices".* FROM "notices" WHERE "notices"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @notice = Notice.find(params[:id])

SELECT "notices".* FROM "notices" WHERE "notices"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "notices" WHERE "notices"."id" = ?  [["id", 1]]
---
  def destroy
    @notice = Notice.find(params[:id])
    @notice.destroy