app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_confirmation", "password_digest", "phone", "updated_at", "user_type") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
		if @user.save